In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import norm

In [2]:
demo1 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_demographic\api_data_aadhar_demographic\api_data_aadhar_demographic_0_500000.csv")
demo2 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_demographic\api_data_aadhar_demographic\api_data_aadhar_demographic_500000_1000000.csv")
demo3 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_demographic\api_data_aadhar_demographic\api_data_aadhar_demographic_1000000_1500000.csv")
demo4 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_demographic\api_data_aadhar_demographic\api_data_aadhar_demographic_1500000_2000000.csv")
demo5 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_demographic\api_data_aadhar_demographic\api_data_aadhar_demographic_2000000_2071700.csv")
demo  = pd.concat([demo1 , demo2 , demo3 , demo4 , demo5], ignore_index=True)
demo.drop('date', axis=1, inplace=True)

In [3]:
enrol1 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_enrolment\api_data_aadhar_enrolment\api_data_aadhar_enrolment_0_500000.csv")
enrol2 = pd.read_csv (r"C:\Users\atulk\Downloads\api_data_aadhar_enrolment\api_data_aadhar_enrolment\api_data_aadhar_enrolment_500000_1000000.csv")
enrol3 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_enrolment\api_data_aadhar_enrolment\api_data_aadhar_enrolment_1000000_1006029.csv")
enrol = pd.concat( [enrol1 , enrol2, enrol3] , ignore_index = True)
enrol.drop('date', axis=1, inplace=True)

In [4]:
bio1 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_biometric\api_data_aadhar_biometric\api_data_aadhar_biometric_0_500000.csv")
bio2 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_biometric\api_data_aadhar_biometric\api_data_aadhar_biometric_500000_1000000.csv")
bio3 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_biometric\api_data_aadhar_biometric\api_data_aadhar_biometric_1000000_1500000.csv")
bio4 = pd.read_csv(r"C:\Users\atulk\Downloads\api_data_aadhar_biometric\api_data_aadhar_biometric\api_data_aadhar_biometric_1500000_1861108.csv")
bio =  pd.concat( [bio1, bio2 , bio3 , bio4] , ignore_index = True)
bio.drop('date', axis=1, inplace=True)

In [5]:
enrol.drop('age_0_5', axis=1, inplace=True)

In [6]:
bio.head()

               state      district  pincode  bio_age_5_17  bio_age_17_
0            Haryana  Mahendragarh   123029           280          577
1              Bihar     Madhepura   852121           144          369
2  Jammu and Kashmir         Punch   185101           643         1091
3              Bihar       Bhojpur   802158           256          980
4         Tamil Nadu       Madurai   625514           271          815

In [7]:
demo.head()

            state    district  pincode  demo_age_5_17  demo_age_17_
0   Uttar Pradesh   Gorakhpur   273213             49           529
1  Andhra Pradesh    Chittoor   517132             22           375
2         Gujarat      Rajkot   360006             65           765
3  Andhra Pradesh  Srikakulam   532484             24           314
4       Rajasthan     Udaipur   313801             45           785

In [8]:
final_bio =  bio.groupby('state')[[  'bio_age_5_17' , 'bio_age_17_' ]].sum().reset_index()

In [9]:
final_demo =  demo.groupby('state')[[  'demo_age_5_17' , 'demo_age_17_' ]].sum().reset_index()

In [10]:
df1 = pd.merge(final_bio, final_demo, on='state', how='outer')

In [11]:
df1 = df1[1:]

In [12]:
df1

,state,bio_age_5_17,bio_age_17_,demo_age_5_17,demo_age_17_
1,Andaman & Nicobar Islands,405.0,1979.0,13.0,1046.0
2,Andaman and Nicobar Islands,11401.0,6913.0,604.0,5583.0
3,Andhra Pradesh,2241448.0,1473144.0,321143.0,1974362.0
4,Arunachal Pradesh,42894.0,29500.0,5783.0,30660.0
5,Assam,596624.0,386098.0,84480.0,928098.0
...,...,...,...,...,...
61,West bengal,5.0,15.0,0.0,60.0
62,Westbengal,2.0,17.0,0.0,95.0
63,andhra pradesh,19.0,22.0,5.0,72.0
64,odisha,0.0,16.0,0.0,20.0
65,west Bengal,1.0,0.0,0.0,15.0

In [13]:
df1.to_excel("state.xlsx", index=False)

In [14]:
df = pd.read_excel(r"C:\Users\atulk\Downloads\state.xlsx")

In [29]:
df.count()

state          35
state_ratio    35
state_score    35
dtype: int64

In [30]:
df.head()

                         state  state_ratio  state_score
0  Andaman and Nicobar Islands     0.350082     8.224674
1            Arunachal Pradesh     0.503398    20.109582
2                        Assam     1.030381    60.960798
3                        Bihar     0.983004    57.288221
4                  Chhatisgarh     0.757131    39.778702

In [17]:
df2 =  df1.groupby('state')[[  'demo_age_5_17' , 'demo_age_17_' , 'bio_age_5_17' ,'bio_age_17_' ]].sum().reset_index()

In [19]:
df2.count()

state            65
demo_age_5_17    65
demo_age_17_     65
bio_age_5_17     65
bio_age_17_      65
dtype: int64

In [20]:
bio_age_sum = ['bio_age_5_17' , 'bio_age_17_']
df2['bio_total']= df2[bio_age_sum].sum(axis=1)

In [21]:
df2.head()

,state,demo_age_5_17,demo_age_17_,bio_age_5_17,bio_age_17_,bio_total
0,Andaman & Nicobar Islands,13.0,1046.0,405.0,1979.0,2384.0
1,Andaman and Nicobar Islands,604.0,5583.0,11401.0,6913.0,18314.0
2,Andhra Pradesh,321143.0,1974362.0,2241448.0,1473144.0,3714592.0
3,Arunachal Pradesh,5783.0,30660.0,42894.0,29500.0,72394.0
4,Assam,84480.0,928098.0,596624.0,386098.0,982722.0

In [22]:
demo_age_sum = ['demo_age_5_17','demo_age_17_']
df2['demo_total']= df2[demo_age_sum].sum(axis=1)

In [23]:
df2.head()

,state,demo_age_5_17,demo_age_17_,bio_age_5_17,bio_age_17_,bio_total,demo_total
0,Andaman & Nicobar Islands,13.0,1046.0,405.0,1979.0,2384.0,1059.0
1,Andaman and Nicobar Islands,604.0,5583.0,11401.0,6913.0,18314.0,6187.0
2,Andhra Pradesh,321143.0,1974362.0,2241448.0,1473144.0,3714592.0,2295505.0
3,Arunachal Pradesh,5783.0,30660.0,42894.0,29500.0,72394.0,36443.0
4,Assam,84480.0,928098.0,596624.0,386098.0,982722.0,1012578.0

In [24]:
df2['state_ratio'] = df2['demo_total'] / df2['bio_total']

In [25]:
min_val = df['state_ratio'].min()
max_val = df['state_ratio'].max()

df['state_score'] = ((df['state_ratio'] - min_val) / (max_val - min_val)) * 100

In [26]:
df.head()

                         state  state_ratio  state_score
0  Andaman and Nicobar Islands     0.350082     8.224674
1            Arunachal Pradesh     0.503398    20.109582
2                        Assam     1.030381    60.960798
3                        Bihar     0.983004    57.288221
4                  Chhatisgarh     0.757131    39.778702

In [27]:
df2[['state', 'state_ratio']].to_excel('state.xlsx', index=False)

In [31]:
df.to_excel('state11.xlsx', index=False)